MikroElektronika/core_packages/PIC/XC8/def/PIC18LF27J13/mcu.h
// Register: CVRCON
#define CVRCON CVRCON
extern volatile unsigned char           CVRCON              __at(0xF53);
#ifndef _LIB_BUILD
asm("CVRCON equ 0F53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CVR                    :4;
        unsigned CVRSS                  :1;
        unsigned CVRR                   :1;
        unsigned CVROE                  :1;
        unsigned CVREN                  :1;
    };
    struct {
        unsigned CVR0                   :1;
        unsigned CVR1                   :1;
        unsigned CVR2                   :1;
        unsigned CVR3                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned CVROEN                 :1;
    };
} CVRCONbits_t;
extern volatile CVRCONbits_t CVRCONbits __at(0xF53);
// bitfield macros
#define _CVRCON_CVR_POSN                                    0x0
#define _CVRCON_CVR_POSITION                                0x0
#define _CVRCON_CVR_SIZE                                    0x4
#define _CVRCON_CVR_LENGTH                                  0x4
#define _CVRCON_CVR_MASK                                    0xF
#define _CVRCON_CVRSS_POSN                                  0x4
#define _CVRCON_CVRSS_POSITION                              0x4
#define _CVRCON_CVRSS_SIZE                                  0x1
#define _CVRCON_CVRSS_LENGTH                                0x1
#define _CVRCON_CVRSS_MASK                                  0x10
#define _CVRCON_CVRR_POSN                                   0x5
#define _CVRCON_CVRR_POSITION                               0x5
#define _CVRCON_CVRR_SIZE                                   0x1
#define _CVRCON_CVRR_LENGTH                                 0x1
#define _CVRCON_CVRR_MASK                                   0x20
#define _CVRCON_CVROE_POSN                                  0x6
#define _CVRCON_CVROE_POSITION                              0x6
#define _CVRCON_CVROE_SIZE                                  0x1
#define _CVRCON_CVROE_LENGTH                                0x1
#define _CVRCON_CVROE_MASK                                  0x40
#define _CVRCON_CVREN_POSN                                  0x7
#define _CVRCON_CVREN_POSITION                              0x7
#define _CVRCON_CVREN_SIZE                                  0x1
#define _CVRCON_CVREN_LENGTH                                0x1
#define _CVRCON_CVREN_MASK                                  0x80
#define _CVRCON_CVR0_POSN                                   0x0
#define _CVRCON_CVR0_POSITION                               0x0
#define _CVRCON_CVR0_SIZE                                   0x1
#define _CVRCON_CVR0_LENGTH                                 0x1
#define _CVRCON_CVR0_MASK                                   0x1
#define _CVRCON_CVR1_POSN                                   0x1
#define _CVRCON_CVR1_POSITION                               0x1
#define _CVRCON_CVR1_SIZE                                   0x1
#define _CVRCON_CVR1_LENGTH                                 0x1
#define _CVRCON_CVR1_MASK                                   0x2
#define _CVRCON_CVR2_POSN                                   0x2
#define _CVRCON_CVR2_POSITION                               0x2
#define _CVRCON_CVR2_SIZE                                   0x1
#define _CVRCON_CVR2_LENGTH                                 0x1
#define _CVRCON_CVR2_MASK                                   0x4
#define _CVRCON_CVR3_POSN                                   0x3
#define _CVRCON_CVR3_POSITION                               0x3
#define _CVRCON_CVR3_SIZE                                   0x1
#define _CVRCON_CVR3_LENGTH                                 0x1
#define _CVRCON_CVR3_MASK                                   0x8
#define _CVRCON_CVROEN_POSN                                 0x6
#define _CVRCON_CVROEN_POSITION                             0x6
#define _CVRCON_CVROEN_SIZE                                 0x1
#define _CVRCON_CVROEN_LENGTH                               0x1
#define _CVRCON_CVROEN_MASK                                 0x40

// Register: DMABCH
#define DMABCH DMABCH
extern volatile unsigned char           DMABCH              __at(0xF66);
#ifndef _LIB_BUILD
asm("DMABCH equ 0F66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMACNTHB               :2;
    };
} DMABCHbits_t;
extern volatile DMABCHbits_t DMABCHbits __at(0xF66);
// bitfield macros
#define _DMABCH_DMACNTHB_POSN                               0x0
#define _DMABCH_DMACNTHB_POSITION                           0x0
#define _DMABCH_DMACNTHB_SIZE                               0x2
#define _DMABCH_DMACNTHB_LENGTH                             0x2
#define _DMABCH_DMACNTHB_MASK                               0x3

// Register: DMABCL
#define DMABCL DMABCL
extern volatile unsigned char           DMABCL              __at(0xF67);
#ifndef _LIB_BUILD
asm("DMABCL equ 0F67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMACNTLB               :8;
    };
} DMABCLbits_t;
extern volatile DMABCLbits_t DMABCLbits __at(0xF67);
// bitfield macros
#define _DMABCL_DMACNTLB_POSN                               0x0
#define _DMABCL_DMACNTLB_POSITION                           0x0
#define _DMABCL_DMACNTLB_SIZE                               0x8
#define _DMABCL_DMACNTLB_LENGTH                             0x8
#define _DMABCL_DMACNTLB_MASK                               0xFF

// Register: RXADDRH
#define RXADDRH RXADDRH
extern volatile unsigned char           RXADDRH             __at(0xF68);
#ifndef _LIB_BUILD
asm("RXADDRH equ 0F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMARCVPTRHB            :4;
    };
} RXADDRHbits_t;
extern volatile RXADDRHbits_t RXADDRHbits __at(0xF68);
// bitfield macros
#define _RXADDRH_DMARCVPTRHB_POSN                           0x0
#define _RXADDRH_DMARCVPTRHB_POSITION                       0x0
#define _RXADDRH_DMARCVPTRHB_SIZE                           0x4
#define _RXADDRH_DMARCVPTRHB_LENGTH                         0x4
#define _RXADDRH_DMARCVPTRHB_MASK                           0xF

